# Formulas
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Manage multiple Node.js versions
brew "nvm"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Vi "workalike" with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh syntax highlighting
brew "zsh-syntax-highlighting"
# Note taking with sync
brew "joplin-cli"

# Casks
# Terminal emulator alternative
cask "iterm2"
# Web browser
cask "firefox"
# Web browser
cask "arc"
# Clipboard manager
cask "maccy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# VPN client
cask "mullvadvpn"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Note taking with sync
cask "joplin"
# Instant messaging
cask "signal"
# Transfer files android
cask "android-file-transfer"
# Multimedia player
cask "vlc"
